Practicas/PracticasGretl/Lecc05.org
#+title:  Lección 5
#+author: Marcos Bujosa
#+STARTUP: show4levels
#+LANGUAGE: es-es

#+EXPORT_FILE_NAME: pub/Lecc05

# +OPTIONS: toc:nil
#+OPTIONS: tags:nil

#+LATEX_CLASS: article

#+LATEX_HEADER: \usepackage[spanish]{babel}
#+LATEX_HEADER: \usepackage[margin=0.5in]{geometry}
#+LaTeX_HEADER: \usepackage[svgnames,x11names]{xcolor}
#+LaTeX_HEADER: \hypersetup{linktoc = all, colorlinks = true, urlcolor = DodgerBlue4, citecolor = PaleGreen1, linkcolor = SpringGreen4}
#+LaTeX_HEADER: \PassOptionsToPackage{hyphens}{url}
#+LaTeX_HEADER: \usepackage{nacal}

#+LaTeX_HEADER: \usepackage{framed}

#+LaTeX_HEADER: \usepackage{listings}
#+LaTeX_HEADER: \input{hansl.tex}
#+LaTeX_HEADER: \lstnewenvironment{hansl-gretl}
#+LaTeX_HEADER: {\lstset{language={hansl},basicstyle={\ttfamily\footnotesize},numbers,rame=single,breaklines=true}}
#+LaTeX_HEADER: {}
#+LaTeX_HEADER: \newcommand{\hansl}[1]{\lstset{language={hansl},basicstyle={\ttfamily\small}}\lstinline{#1}}
# +LaTeX_HEADER: \lstset{backgroundcolor=\color{white},basicstyle=\ttfamily\footnotesize,breaklines=true, captionpos=b,commentstyle=\color{mygreen},escapeinside={\%*}{*)}, keywordstyle=\color{blue},stringstyle=\color{mymauve}, }
# +LaTeX_HEADER: \lstset{backgroundcolor=\color{lightgray!20},basicstyle=\ttfamily\footnotesize,breaklines=true, }
#+LaTeX_HEADER: \lstset{backgroundcolor=\color{lightgray!20}, }

#+name: setup-listings
#+begin_src emacs-lisp :exports none :results silent
  (setq org-latex-listings 'listings)
  (setq org-latex-custom-lang-environments
  	;'((emacs-lisp "common-lispcode")))
  	'((emacs-lisp "hansl-gretl")))
  (setq org-latex-listings-options
	'(("frame" "lines")
	  ("basicstyle" "\\scriptsize")
	  ("basicstyle" "\\ttfamily")
	  ("numbers=none" "left")
	  ("backgroundcolor=\\color{lightgray!20}")
	  ("numberstyle" "\\tiny")))
  (setq org-latex-to-pdf-process
	'("pdflatex -interaction nonstopmode -output-directory %o %f"
	"pdflatex -interaction nonstopmode -output-directory %o %f"
	"pdflatex -interaction nonstopmode -output-directory %o %f"))
  (org-add-link-type
   "latex" nil
   (lambda (path desc format)
     (cond
      ((eq format 'html)
       (format "<span class=\"%s\">%s</span>" path desc))
      ((eq format 'latex)
       (format "\\%s{%s}" path desc)))))
#+end_src

# \lstnewenvironment{code}
#     {\lstset{language=haskell,
#     basicstyle=\small\ttfamily,
#     numbers=left,
#     numberstyle=\tiny\color{gray},
#     backgroundcolor=\color{lightgray},
#     firstnumber=auto
#     }}
#     {}

#+bibliography: ref.bib

# +latex: \clearpage

#+LATEX: \clearpage

* Simulación del ejemplo del precio de las viviendas con tres regresores

| Guión: | [[https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/BucleSimuladorEjPvivienda.inp][BucleSimuladorEjPvivienda.inp]] |

En este ejercicio con [[https://gretl.sourceforge.net/es.html][Gretl]] usaremos un bucle para generar muchas
veces datos simulados con los que realizar muchas regresiones MCO de
un mismo modelo y así observar el comportamiento del estimador MCO.

** Tareas

- Fijamos el tamaño muestral :: Simulamos series de datos de 500
  observaciones. Indicamos la opción =--preserve= para que Gretl
  mantenga en memoria el escalar que fija el tamaño muestral =TM=
#+name: Fijamos el tamaño muestral
#+begin_src hansl
scalar TM  = 500
nulldata --preserve TM
#+end_src

- Simulamos S y D :: Generamos dos variables que serán los regresores
  no constantes: =S= con distribución uniforme (35, 120); =D= con
  distribución Chi cuadrado con 5 grados de libertad que vamos a
  multiplicar por 3
#+name: Simulamos S y D
#+begin_src hansl 
series S = randgen(U, 35, 120)
series D = randgen(X, 5) * 3
#+end_src

- Parte sistemática :: La parte /sistemática/ del modelo es
  $\Vect[s]{y} = 100(\Vect{1}) + 3\Vect{s} - 130\Vect{D}$
#+name: Parte sistemática 
#+begin_src hansl 
series YS = 100 + 3*S - 130*D
#+end_src

- Esperanza y desviación típica de U :: En cada iteración generaremos
  una nueva perturbación =U= con media cero =mu=0= y desviación típica
  =sigma=100= (por tanto la longitud o norma de =U= será 100 en cada
  iteración)
#+name: Esperanza y desviación típica de U
#+begin_src hansl 
scalar mu    = 0
scalar sigma = 100
#+end_src

- Generación del vector de perturbaciones U :: 
#+name: Generación del vector de perturbaciones U
#+begin_src hansl 
series U = randgen(N, mu ,sigma )
#+end_src

- Comprobación de si U es ortogonal a los regresores S y D :: Dos
  vectores son perpendiculares si la media del producto Hadamard
  (componente a componente) entre ellos es nula. Si uno de los
  vectores tiene media nula, entonces ambos vectores son ortogonales
  si su correlación es nula. Vamos a calcular estos estadísticos
#+name: Comprobación de si U es ortogonal a los regresores S y D
#+begin_src hansl 
scalar mU  = mean(U)
scalar mUS = mean(U*S)
scalar mUD = mean(U*D)
scalar cUS = corr(U,S)
scalar cUD = corr(U,D)
#+end_src

- Parámetros beta estimados :: En cada iteración guardamos los betas
  estimados
#+name: Parámetros beta estimados
#+begin_src hansl
scalar b1 = $coeff(const)
scalar b2 = $coeff(S)
scalar b3 = $coeff(D)
#+end_src

- Visualización de resultados y guardado en disco :: Para estudiar los
  resultados, mostramos los estadísticos calculados y los guardamos en
  el fichero ~coef.gdt~.
#+name: Visualización de resultados y guardado en disco
#+begin_src hansl
print mU mUS mUD cUS cUD b1 b2 b3
store "@workdir/coef.gdt" mU mUS mUD cUS cUD b1 b2 b3
#+end_src

- Análisis gráfico de los resultados :: Una vez finalizado el bucle,
  pedimos a Gretl que abra el fichero de resultados guardado (se
  abrirá nueva sesión) y generamos unos diagramas donde vamos a ver
  cómo perturbaciones más alejadas de la perpendicularidad con los
  regresores afectan más a las estimaciones del parámetro beta
  asociado al regresor correspondiente.
#+name: Análisis gráfico de los resultados
#+begin_src hansl 
open "@workdir/coef.gdt"
MediaU_b1  <- gnuplot b1 mU  --output="display"
CorrUS_b2  <- gnuplot b2 cUS --output="display"
CorrUD_b3  <- gnuplot b3 cUD --output="display"
CorrUD_b2  <- gnuplot b2 cUD --output="display"
CorrUS_b3  <- gnuplot b3 cUS --output="display"
#+end_src

** Estructura del guión

#+begin_src hansl :noweb tangle :tangle ./pub/scripts/BucleSimuladorEjPvivienda.inp
<<Fijamos el tamaño muestral>>
<<Simulamos S y D>>
<<Parte sistemática>>
<<Esperanza y desviación típica de U>>
loop 5000 --progressive --quiet
     <<Generación del vector de perturbaciones U>>
     series Y  = YS + U
     <<Comprobación de si U es ortogonal a los regresores S y D>>
     ols Y 0 S D
     <<Parámetros beta estimados>>
     <<Visualización de resultados y guardado en disco>>
endloop
<<Análisis gráfico de los resultados>>
#+end_src

# +LATEX: \clearpage
#+latex: \noindent
*Código completo de la práctica* ~BucleSimuladorEjPvivienda.inp~
#+latex: \vspace{10pt}
\lstinputlisting{scripts/BucleSimuladorEjPvivienda.inp}
#+LATEX: \clearpage


* Simulación del ejemplo del precio de las viviendas con tres regresores que cambian

| Guión: | [[https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/BucleSimuladorEjPvivienda2.inp][BucleSimuladorEjPvivienda2.inp]] |

En este ejercicio con [[https://gretl.sourceforge.net/es.html][Gretl]] repetimos lo anterior, pero en cada
iteración también cambian los regresores.

** Estructura del guión

#+begin_src hansl :noweb tangle :tangle ./pub/scripts/BucleSimuladorEjPvivienda2.inp
<<Fijamos el tamaño muestral>>
<<Esperanza y desviación típica de U>>
loop 5000 --progressive --quiet
     <<Simulamos S y D>>
     <<Parte sistemática>>
     <<Generación del vector de perturbaciones U>>
     series Y  = YS + U
     <<Comprobación de si U es ortogonal a los regresores S y D>>
     ols Y 0 S D
     <<Parámetros beta estimados>>
     <<Visualización de resultados y guardado en disco>>
endloop
<<Análisis gráfico de los resultados>>
#+end_src

# +LATEX: \clearpage
#+latex: \noindent
*Código completo de la práctica* ~BucleSimuladorEjPvivienda2.inp~
#+latex: \vspace{10pt}
\lstinputlisting{scripts/BucleSimuladorEjPvivienda2.inp}
#+LATEX: \clearpage


* Simulación del ejemplo del precio de las viviendas con tres regresores que cambian pero U se mantiene

| Guión: | [[https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/BucleSimuladorEjPvivienda3.inp][BucleSimuladorEjPvivienda3.inp]] |

En este ejercicio con [[https://gretl.sourceforge.net/es.html][Gretl]] repetimos lo anterior, pero en cada
iteración solo cambian los regresores.

