Practicas/PracticasGretl/pub/Lecc05.tex
% Created 2023-11-02 jue 21:49
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[spanish, ]{babel}
\usepackage[margin=0.5in]{geometry}
\usepackage[svgnames,x11names]{xcolor}
\hypersetup{linktoc = all, colorlinks = true, urlcolor = DodgerBlue4, citecolor = PaleGreen1, linkcolor = SpringGreen4}
\PassOptionsToPackage{hyphens}{url}
\usepackage{nacal}
\usepackage{framed}
\usepackage{listings}
\input{hansl.tex}
\lstnewenvironment{hansl-gretl}
{\lstset{language={hansl},basicstyle={\ttfamily\footnotesize},numbers,rame=single,breaklines=true}}
{}
\newcommand{\hansl}[1]{\lstset{language={hansl},basicstyle={\ttfamily\small}}\lstinline{#1}}
\lstset{backgroundcolor=\color{lightgray!20}, }
\author{Marcos Bujosa}
\date{\today}
\title{Lección 5}
\begin{document}

\maketitle
\tableofcontents

\clearpage

\section{Simulación del ejemplo del precio de las viviendas con tres regresores}
\label{sec:org382e5c7}

\begin{center}
\begin{tabular}{ll}
Guión: & \href{https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/BucleSimuladorEjPvivienda.inp}{BucleSimuladorEjPvivienda.inp}\\[0pt]
\end{tabular}
\end{center}

En este ejercicio con \href{https://gretl.sourceforge.net/es.html}{Gretl} usaremos un bucle para generar muchas
veces datos simulados con los que realizar muchas regresiones MCO de
un mismo modelo y así observar el comportamiento del estimador MCO.

\subsection{Tareas}
\label{sec:org98f3006}

\begin{description}
\item[{Fijamos el tamaño muestral}] Simulamos series de datos de 500
observaciones. Indicamos la opción \texttt{-{}-preserve} para que Gretl
mantenga en memoria el escalar que fija el tamaño muestral \texttt{TM}
\end{description}
\begin{verbatim}
scalar TM  = 500
nulldata --preserve TM
\end{verbatim}

\begin{description}
\item[{Simulamos S y D}] Generamos dos variables que serán los regresores
no constantes: \texttt{S} con distribución uniforme (35, 120); \texttt{D} con
distribución Chi cuadrado con 5 grados de libertad que vamos a
multiplicar por 3
\end{description}
\begin{verbatim}
series S = randgen(U, 35, 120)
series D = randgen(X, 5) * 3
\end{verbatim}

\begin{description}
\item[{Parte sistemática}] La parte \emph{sistemática} del modelo es
\(\Vect[s]{y} = 100(\Vect{1}) + 3\Vect{s} - 130\Vect{D}\)
\end{description}
\begin{verbatim}
series YS = 100 + 3*S - 130*D
\end{verbatim}

\begin{description}
\item[{Esperanza y desviación típica de U}] En cada iteración generaremos
una nueva perturbación \texttt{U} con media cero \texttt{mu=0} y desviación típica
\texttt{sigma=100} (por tanto la longitud o norma de \texttt{U} será 100 en cada
iteración)
\end{description}
\begin{verbatim}
scalar mu    = 0
scalar sigma = 100
\end{verbatim}

\begin{description}
\item[{Generación del vector de perturbaciones U}] 
\end{description}
\begin{verbatim}
series U = randgen(N, mu ,sigma )
\end{verbatim}

\begin{description}
\item[{Comprobación de si U es ortogonal a los regresores S y D}] Dos
vectores son perpendiculares si la media del producto Hadamard
(componente a componente) entre ellos es nula. Si uno de los
vectores tiene media nula, entonces ambos vectores son ortogonales
si su correlación es nula. Vamos a calcular estos estadísticos
\end{description}
\begin{verbatim}
scalar mU  = mean(U)
scalar mUS = mean(U*S)
scalar mUD = mean(U*D)
scalar cUS = corr(U,S)
scalar cUD = corr(U,D)
\end{verbatim}

\begin{description}
\item[{Parámetros beta estimados}] En cada iteración guardamos los betas
estimados
\end{description}
\begin{verbatim}
scalar b1 = $coeff(const)
scalar b2 = $coeff(S)
scalar b3 = $coeff(D)
\end{verbatim}

\begin{description}
\item[{Visualización de resultados y guardado en disco}] Para estudiar los
resultados, mostramos los estadísticos calculados y los guardamos en
el fichero \texttt{coef.gdt}.
\end{description}
\begin{verbatim}
print mU mUS mUD cUS cUD b1 b2 b3
store "@workdir/coef.gdt" mU mUS mUD cUS cUD b1 b2 b3
\end{verbatim}

\begin{description}
\item[{Análisis gráfico de los resultados}] Una vez finalizado el bucle,
pedimos a Gretl que abra el fichero de resultados guardado (se
abrirá nueva sesión) y generamos unos diagramas donde vamos a ver
cómo perturbaciones más alejadas de la perpendicularidad con los
regresores afectan más a las estimaciones del parámetro beta
asociado al regresor correspondiente.
\end{description}
\begin{verbatim}
open "@workdir/coef.gdt"
MediaU_b1  <- gnuplot b1 mU  --output="display"
CorrUS_b2  <- gnuplot b2 cUS --output="display"
CorrUD_b3  <- gnuplot b3 cUD --output="display"
CorrUD_b2  <- gnuplot b2 cUD --output="display"
CorrUS_b3  <- gnuplot b3 cUS --output="display"
\end{verbatim}

\subsection{Estructura del guión}
\label{sec:org15e73c1}

\begin{verbatim}
<<Fijamos el tamaño muestral>>
<<Simulamos S y D>>
<<Parte sistemática>>
<<Esperanza y desviación típica de U>>
loop 5000 --progressive --quiet
     <<Generación del vector de perturbaciones U>>
     series Y  = YS + U
     <<Comprobación de si U es ortogonal a los regresores S y D>>
     ols Y 0 S D
     <<Parámetros beta estimados>>
     <<Visualización de resultados y guardado en disco>>
endloop
<<Análisis gráfico de los resultados>>
\end{verbatim}

\noindent
\textbf{Código completo de la práctica} \texttt{BucleSimuladorEjPvivienda.inp}
\vspace{10pt}
\lstinputlisting{scripts/BucleSimuladorEjPvivienda.inp}
\clearpage


\section{Simulación del ejemplo del precio de las viviendas con tres regresores que cambian}
\label{sec:org7fef4a2}

\begin{center}
\begin{tabular}{ll}
Guión: & \href{https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/BucleSimuladorEjPvivienda2.inp}{BucleSimuladorEjPvivienda2.inp}\\[0pt]
\end{tabular}
\end{center}

En este ejercicio con \href{https://gretl.sourceforge.net/es.html}{Gretl} repetimos lo anterior, pero en cada
iteración también cambian los regresores.

\subsection{Estructura del guión}
\label{sec:org0f6d24a}

\begin{verbatim}
<<Fijamos el tamaño muestral>>
<<Esperanza y desviación típica de U>>
loop 5000 --progressive --quiet
     <<Simulamos S y D>>
     <<Parte sistemática>>
     <<Generación del vector de perturbaciones U>>
     series Y  = YS + U
     <<Comprobación de si U es ortogonal a los regresores S y D>>
     ols Y 0 S D
     <<Parámetros beta estimados>>
     <<Visualización de resultados y guardado en disco>>
endloop
<<Análisis gráfico de los resultados>>
\end{verbatim}

\noindent
\textbf{Código completo de la práctica} \texttt{BucleSimuladorEjPvivienda2.inp}
\vspace{10pt}
\lstinputlisting{scripts/BucleSimuladorEjPvivienda2.inp}
\clearpage


\section{Simulación del ejemplo del precio de las viviendas con tres regresores que cambian pero U se mantiene}
\label{sec:org2edd499}

\begin{center}
\begin{tabular}{ll}
Guión: & \href{https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/BucleSimuladorEjPvivienda3.inp}{BucleSimuladorEjPvivienda3.inp}\\[0pt]
\end{tabular}
\end{center}

En este ejercicio con \href{https://gretl.sourceforge.net/es.html}{Gretl} repetimos lo anterior, pero en cada
iteración solo cambian los regresores.
