Practicas/PracticasGretl/Lecc05.org
** Estructura del guión

#+begin_src hansl :noweb tangle :tangle ./pub/scripts/BucleSimuladorEjPvivienda3.inp
<<Fijamos el tamaño muestral>>
<<Esperanza y desviación típica de U>>
<<Generación del vector de perturbaciones U>>
loop 5000 --progressive --quiet
     <<Simulamos S y D>>
     <<Parte sistemática>>
     series Y  = YS + U
     <<Comprobación de si U es ortogonal a los regresores S y D>>
     ols Y 0 S D
     <<Parámetros beta estimados>>
     <<Visualización de resultados y guardado en disco>>
endloop
<<Análisis gráfico de los resultados>>
#+end_src

# +LATEX: \clearpage
#+latex: \noindent
*Código completo de la práctica* ~BucleSimuladorEjPvivienda3.inp~
#+latex: \vspace{10pt}
\lstinputlisting{scripts/BucleSimuladorEjPvivienda3.inp}
#+LATEX: \clearpage


* Simulación del ejemplo del precio de las viviendas con tres regresores ortogonales

| Guión: | [[https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/BucleSimuladorEjPvivienda4.inp][BucleSimuladorEjPvivienda4.inp]] |

En este ejercicio con [[https://gretl.sourceforge.net/es.html][Gretl]] repetimos lo anterior, pero en cada
iteración cambia la perturbación y cambian los regresores, pero los
regresores son ortogonales entre si.

- Simulamos S y D ortogonales :: Generamos dos variables que serán los
  regresores no constantes: =S= con distribución uniforme (35, 120);
  =D= con distribución Chi cuadrado con 5 grados de libertad que vamos
  a multiplicar por 3; pero luego ortogonalizamos los regresores.
#+name: Simulamos S y D ortogonales
#+begin_src hansl 
series S0 = randgen(U, 35, 120)
series D0 = randgen(X, 5) * 3
ols S0 0
series S = $uhat
ols D0 0 S
series D = $uhat
#+end_src

** Estructura del guión

#+begin_src hansl :noweb tangle :tangle ./pub/scripts/BucleSimuladorEjPvivienda4.inp
<<Fijamos el tamaño muestral>>
<<Esperanza y desviación típica de U>>
loop 5000 --progressive --quiet
     <<Simulamos S y D ortogonales>>
     <<Parte sistemática>>
     <<Generación del vector de perturbaciones U>>
     series Y  = YS + U
     <<Comprobación de si U es ortogonal a los regresores S y D>>
     ols Y 0 S D
     <<Parámetros beta estimados>>
     <<Visualización de resultados y guardado en disco>>
endloop
<<Análisis gráfico de los resultados>>
#+end_src

#+LATEX: \clearpage
#+latex: \noindent
*Código completo de la práctica* ~BucleSimuladorEjPvivienda4.inp~
#+latex: \vspace{10pt}
\lstinputlisting{scripts/BucleSimuladorEjPvivienda4.inp}
#+LATEX: \clearpage


* Simulación del ejemplo del precio de las viviendas forzando a que la muestra de U cumpla los supuestos

| Guión: | [[https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/BucleSimuladorEjPvivienda5.inp][BucleSimuladorEjPvivienda5.inp]] |

En este ejercicio con [[https://gretl.sourceforge.net/es.html][Gretl]] repetimos lo anterior, pero en cada
iteración también cambian los regresores.

- Generación del vector de perturbaciones U forzando que la muestra cumpla los supuestos ::
#+name: Generación del vector de perturbaciones U forzando que la muestra cumpla los supuestos
#+begin_src hansl
series U  = randgen(N, 0, 1)
series U  = U - mean(U)
series U  = U / sqrt( var(U)*(TM-1)/TM )
series U  = mu + sigma * U
ols U 0 S D
series U  = $uhat
#+end_src

** Estructura del guión

#+begin_src hansl :noweb tangle :tangle ./pub/scripts/BucleSimuladorEjPvivienda5.inp
<<Fijamos el tamaño muestral>>
<<Esperanza y desviación típica de U>>
loop 5000 --progressive --quiet
     <<Simulamos S y D>>
     <<Parte sistemática>>
     <<Generación del vector de perturbaciones U forzando que la muestra cumpla los supuestos>>
     series Y  = YS + U
     <<Comprobación de si U es ortogonal a los regresores S y D>>
     ols Y 0 S D
     <<Parámetros beta estimados>>
     <<Visualización de resultados y guardado en disco>>
endloop
<<Análisis gráfico de los resultados>>
#+end_src

#+LATEX: \clearpage
#+latex: \noindent
*Código completo de la práctica* ~BucleSimuladorEjPvivienda5.inp~
#+latex: \vspace{10pt}
\lstinputlisting{scripts/BucleSimuladorEjPvivienda5.inp}
#+LATEX: \clearpage


* Efectos del incumplimiento de algunos supuestos (perturbaciones sin esperanza nula)

| Guión: | [[https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/BucleSimuladorEjPvivienda6.inp][BucleSimuladorEjPvivienda6.inp]] |

Vamos a ver cómo afecta a las estimaciones simular modelos que
incumplen algunos de los supuestos. Por ejemplo, ¿qué pasa si las
perturbaciones tienen esperanza no nula?

** Estructura del guión

#+begin_src hansl :noweb tangle :tangle ./pub/scripts/BucleSimuladorEjPvivienda6.inp
<<Fijamos el tamaño muestral>>
scalar mu    = 1000
scalar sigma = 100
loop 5000 --progressive --quiet
     <<Simulamos S y D>>
     <<Parte sistemática>>
     <<Generación del vector de perturbaciones U>>
     series Y  = YS + U
     <<Comprobación de si U es ortogonal a los regresores S y D>>
     ols Y 0 S D
     <<Parámetros beta estimados>>
     <<Visualización de resultados y guardado en disco>>
endloop
<<Análisis gráfico de los resultados>>
#+end_src

# +LATEX: \clearpage
#+latex: \noindent
*Código completo de la práctica* ~BucleSimuladorEjPvivienda6.inp~
#+latex: \vspace{10pt}
\lstinputlisting{scripts/BucleSimuladorEjPvivienda6.inp}
#+LATEX: \clearpage



** COMMENT Antiguo enunciado
- Modifique el guión ~BucleSimuladorEjPvivienda2.inp~ de la Práctica
  [[Simulación del ejemplo del precio de las viviendas con tres
  regresores que cambian]] para que genere modelos con perturbaciones
  que no tienen esperanza nula.

  + ¿Qué ocurre con los parámetros estimados? ¿Qué se ve más afectado
    las pendientes o la constante? Pruebe con distintos valores
    esperados (positivos, negativos y mayores o menores en valor
    absoluto).

  + La dispersión de las estimaciones ¿se ve también afectada?  ¿o
    sólo los valores medios?
    
  + Fuera del bucle, genere alguna simulación y observe el diagrama de
    dispersión entre los precios simulados y las superficies.

- Verifique que
  + Los residuos tienen media cero (pues la regresión tiene término constante)
  + Los residuos son perpendiculares a \textsf{S}
  + Los residuos son perpendiculares a \textsf{D}
  + No obstante, dado que los residuos tienen media cero (son
    variables centradas) la correlación mide el coseno del ángulo, así
    que la correlación entre los residuos y los regresores es cero.


* Efectos del incumplimiento de algunos supuestos (perturbaciones no ortogonales a S)

| Guión: | [[https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/BucleSimuladorEjPvivienda7.inp][BucleSimuladorEjPvivienda7.inp]] |

Vamos a ver cómo afecta a las estimaciones simular modelos que
incumplen algunos de los supuestos. Por ejemplo, ¿qué pasa si las
perturbaciones no son ortogonales a uno o más regresores no
constantes?

- Definición de la matriz para generar correlación entre U y S :: Definimos
  la matriz con la que generar perturbaciones correladas con los
  regresores (/No recuerdo de donde saqué este modo de hacerlo/).
#+name: Definición de la matriz para generar correlación entre U y S
#+begin_src hansl
matrix C  = {1 ,   0,   0; 0 ,  1,   0; -10,  0,  1}
#matrix C  = {1 ,   0,   0; 0 ,  1,   0;  0, 100,  1}
#+end_src


- Generación del vector de perturbaciones U correladas con los regresores :: (/No
  recuerdo de donde saqué este modo de hacerlo/).
#+name: Generación del vector de perturbaciones U correladas con los regresores
#+begin_src hansl 
series U0 = randgen(N, 0, 1)
matrix Z = {S,D,U0}
Z *= C'               #  note: use the transpose '
series U  = Z[,3]     # generamos las perturbaciones
#+end_src


** Estructura del guión

#+begin_src hansl :noweb tangle :tangle ./pub/scripts/BucleSimuladorEjPvivienda7.inp
<<Fijamos el tamaño muestral>>
<<Esperanza y desviación típica de U>>
<<Definición de la matriz para generar correlación entre U y S>>
loop 5000 --progressive --quiet
     <<Simulamos S y D>>
     <<Parte sistemática>>
     <<Generación del vector de perturbaciones U correladas con los regresores>>
     series Y  = YS + U
     <<Comprobación de si U es ortogonal a los regresores S y D>>
     ols Y 0 S D
     <<Parámetros beta estimados>>
     <<Visualización de resultados y guardado en disco>>
endloop
<<Análisis gráfico de los resultados>>
#+end_src

#+LATEX: \clearpage
#+latex: \noindent
*Código completo de la práctica* ~BucleSimuladorEjPvivienda7.inp~
#+latex: \vspace{10pt}
\lstinputlisting{scripts/BucleSimuladorEjPvivienda7.inp}
#+LATEX: \clearpage


