Practicas/PracticasGretl/pub/Lecc05.tex

\subsection{Estructura del guión}
\label{sec:org8f44412}

\begin{verbatim}
<<Fijamos el tamaño muestral>>
<<Esperanza y desviación típica de U>>
<<Generación del vector de perturbaciones U>>
loop 5000 --progressive --quiet
     <<Simulamos S y D>>
     <<Parte sistemática>>
     series Y  = YS + U
     <<Comprobación de si U es ortogonal a los regresores S y D>>
     ols Y 0 S D
     <<Parámetros beta estimados>>
     <<Visualización de resultados y guardado en disco>>
endloop
<<Análisis gráfico de los resultados>>
\end{verbatim}

\noindent
\textbf{Código completo de la práctica} \texttt{BucleSimuladorEjPvivienda3.inp}
\vspace{10pt}
\lstinputlisting{scripts/BucleSimuladorEjPvivienda3.inp}
\clearpage


\section{Simulación del ejemplo del precio de las viviendas con tres regresores ortogonales}
\label{sec:org9428727}

\begin{center}
\begin{tabular}{ll}
Guión: & \href{https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/BucleSimuladorEjPvivienda4.inp}{BucleSimuladorEjPvivienda4.inp}\\[0pt]
\end{tabular}
\end{center}

En este ejercicio con \href{https://gretl.sourceforge.net/es.html}{Gretl} repetimos lo anterior, pero en cada
iteración cambia la perturbación y cambian los regresores, pero los
regresores son ortogonales entre si.

\begin{description}
\item[{Simulamos S y D ortogonales}] Generamos dos variables que serán los
regresores no constantes: \texttt{S} con distribución uniforme (35, 120);
\texttt{D} con distribución Chi cuadrado con 5 grados de libertad que vamos
a multiplicar por 3; pero luego ortogonalizamos los regresores.
\end{description}
\begin{verbatim}
series S0 = randgen(U, 35, 120)
series D0 = randgen(X, 5) * 3
ols S0 0
series S = $uhat
ols D0 0 S
series D = $uhat
\end{verbatim}

\subsection{Estructura del guión}
\label{sec:org50228fe}

\begin{verbatim}
<<Fijamos el tamaño muestral>>
<<Esperanza y desviación típica de U>>
loop 5000 --progressive --quiet
     <<Simulamos S y D ortogonales>>
     <<Parte sistemática>>
     <<Generación del vector de perturbaciones U>>
     series Y  = YS + U
     <<Comprobación de si U es ortogonal a los regresores S y D>>
     ols Y 0 S D
     <<Parámetros beta estimados>>
     <<Visualización de resultados y guardado en disco>>
endloop
<<Análisis gráfico de los resultados>>
\end{verbatim}

\clearpage
\noindent
\textbf{Código completo de la práctica} \texttt{BucleSimuladorEjPvivienda4.inp}
\vspace{10pt}
\lstinputlisting{scripts/BucleSimuladorEjPvivienda4.inp}
\clearpage


\section{Simulación del ejemplo del precio de las viviendas forzando a que la muestra de U cumpla los supuestos}
\label{sec:org4622744}

\begin{center}
\begin{tabular}{ll}
Guión: & \href{https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/BucleSimuladorEjPvivienda5.inp}{BucleSimuladorEjPvivienda5.inp}\\[0pt]
\end{tabular}
\end{center}

En este ejercicio con \href{https://gretl.sourceforge.net/es.html}{Gretl} repetimos lo anterior, pero en cada
iteración también cambian los regresores.

\begin{description}
\item[{Generación del vector de perturbaciones U forzando que la muestra cumpla los supuestos}] 
\end{description}
\begin{verbatim}
series U  = randgen(N, 0, 1)
series U  = U - mean(U)
series U  = U / sqrt( var(U)*(TM-1)/TM )
series U  = mu + sigma * U
ols U 0 S D
series U  = $uhat
\end{verbatim}

\subsection{Estructura del guión}
\label{sec:org52b6740}

\begin{verbatim}
<<Fijamos el tamaño muestral>>
<<Esperanza y desviación típica de U>>
loop 5000 --progressive --quiet
     <<Simulamos S y D>>
     <<Parte sistemática>>
     <<Generación del vector de perturbaciones U forzando que la muestra cumpla los supuestos>>
     series Y  = YS + U
     <<Comprobación de si U es ortogonal a los regresores S y D>>
     ols Y 0 S D
     <<Parámetros beta estimados>>
     <<Visualización de resultados y guardado en disco>>
endloop
<<Análisis gráfico de los resultados>>
\end{verbatim}

\clearpage
\noindent
\textbf{Código completo de la práctica} \texttt{BucleSimuladorEjPvivienda5.inp}
\vspace{10pt}
\lstinputlisting{scripts/BucleSimuladorEjPvivienda5.inp}
\clearpage


\section{Efectos del incumplimiento de algunos supuestos (perturbaciones sin esperanza nula)}
\label{sec:orgcccfa9b}

\begin{center}
\begin{tabular}{ll}
Guión: & \href{https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/BucleSimuladorEjPvivienda6.inp}{BucleSimuladorEjPvivienda6.inp}\\[0pt]
\end{tabular}
\end{center}

Vamos a ver cómo afecta a las estimaciones simular modelos que
incumplen algunos de los supuestos. Por ejemplo, ¿qué pasa si las
perturbaciones tienen esperanza no nula?

\subsection{Estructura del guión}
\label{sec:org2309048}

\begin{verbatim}
<<Fijamos el tamaño muestral>>
scalar mu    = 1000
scalar sigma = 100
loop 5000 --progressive --quiet
     <<Simulamos S y D>>
     <<Parte sistemática>>
     <<Generación del vector de perturbaciones U>>
     series Y  = YS + U
     <<Comprobación de si U es ortogonal a los regresores S y D>>
     ols Y 0 S D
     <<Parámetros beta estimados>>
     <<Visualización de resultados y guardado en disco>>
endloop
<<Análisis gráfico de los resultados>>
\end{verbatim}

\noindent
\textbf{Código completo de la práctica} \texttt{BucleSimuladorEjPvivienda6.inp}
\vspace{10pt}
\lstinputlisting{scripts/BucleSimuladorEjPvivienda6.inp}
\clearpage



\section{Efectos del incumplimiento de algunos supuestos (perturbaciones no ortogonales a S)}
\label{sec:org3c49044}

\begin{center}
\begin{tabular}{ll}
Guión: & \href{https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/BucleSimuladorEjPvivienda7.inp}{BucleSimuladorEjPvivienda7.inp}\\[0pt]
\end{tabular}
\end{center}

Vamos a ver cómo afecta a las estimaciones simular modelos que
incumplen algunos de los supuestos. Por ejemplo, ¿qué pasa si las
perturbaciones no son ortogonales a uno o más regresores no
constantes?

\begin{description}
\item[{Definición de la matriz para generar correlación entre U y S}] Definimos
la matriz con la que generar perturbaciones correladas con los
regresores (\emph{No recuerdo de donde saqué este modo de hacerlo}).
\end{description}
\begin{verbatim}
matrix C  = {1 ,   0,   0; 0 ,  1,   0; -10,  0,  1}
#matrix C  = {1 ,   0,   0; 0 ,  1,   0;  0, 100,  1}
\end{verbatim}


\begin{description}
\item[{Generación del vector de perturbaciones U correladas con los regresores}] (\emph{No
recuerdo de donde saqué este modo de hacerlo}).
\end{description}
\begin{verbatim}
series U0 = randgen(N, 0, 1)
matrix Z = {S,D,U0}
Z *= C'               #  note: use the transpose '
series U  = Z[,3]     # generamos las perturbaciones
\end{verbatim}


\subsection{Estructura del guión}
\label{sec:org64c0fcc}

\begin{verbatim}
<<Fijamos el tamaño muestral>>
<<Esperanza y desviación típica de U>>
<<Definición de la matriz para generar correlación entre U y S>>
loop 5000 --progressive --quiet
     <<Simulamos S y D>>
     <<Parte sistemática>>
     <<Generación del vector de perturbaciones U correladas con los regresores>>
     series Y  = YS + U
     <<Comprobación de si U es ortogonal a los regresores S y D>>
     ols Y 0 S D
     <<Parámetros beta estimados>>
     <<Visualización de resultados y guardado en disco>>
endloop
<<Análisis gráfico de los resultados>>
\end{verbatim}

\clearpage
\noindent
\textbf{Código completo de la práctica} \texttt{BucleSimuladorEjPvivienda7.inp}
\vspace{10pt}
\lstinputlisting{scripts/BucleSimuladorEjPvivienda7.inp}
\clearpage
\end{document}